In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv("car_data.csv")

In [3]:
data.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Unnamed: 9,Unnamed: 10,Unnamed: 11
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,NaN,NaN,rows=301
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,NaN,NaN,clms=8
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,NaN,NaN,NaN
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,NaN,NaN,NaN
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,NaN,NaN,NaN

In [4]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Selling_Price  301 non-null    float64
 3   Present_Price  301 non-null    float64
 4   Kms_Driven     301 non-null    int64
 5   Fuel_Type      301 non-null    object
 6   Seller_Type    301 non-null    object
 7   Transmission   301 non-null    object
 8   Owner          301 non-null    int64
 9   Unnamed: 9     0 non-null      float64
 10  Unnamed: 10    0 non-null      float64
 11  Unnamed: 11    2 non-null      object
dtypes: float64(4), int64(3), object(5)
memory usage: 28.3+ KB
None

From which manufacturing year to which manufacturing year vehicles are present in this data ?

In [8]:
if 'Year' in data.columns:
    print("\nManufacturing Year Range:", data['Year'].min(), "to", data['Year'].max())

Manufacturing Year Range: 2003 to 2018

What is the lowest price to which a vehicle is sold ?
What is the highest price to which a vehicle is sold ?

In [10]:
if 'Selling_Price' in data.columns:
    print("\nLowest Price:", data['Selling_Price'].min())
    print("Highest Price:", data['Selling_Price'].max())

Lowest Price: 0.1
Highest Price: 35.0

How many records are there in this data ?

In [11]:
print("\nTotal Records:", len(data))

Total Records: 301

Are there any missing records in this data ?

In [12]:
print("Missing Values per Column:")
print(data.isnull().sum())

Missing Values per Column:
Car_Name           0
Year               0
Selling_Price      0
Present_Price      0
Kms_Driven         0
Fuel_Type          0
Seller_Type        0
Transmission       0
Owner              0
Unnamed: 9       301
Unnamed: 10      301
Unnamed: 11      299
dtype: int64

How many different vehicles are present in this data ?

In [13]:
if'Car_Name' in data.columns:
    print("\nTotal Different Vehicles:", data['Car_Name'].nunique())

Total Different Vehicles: 98

Which is the most sold vehicle in this data ?

In [14]:
if 'Car_Name' in data.columns:
    print("Most Sold Vehicle:", data['Car_Name'].value_counts().idxmax())

Most Sold Vehicle: city

Does the database include any CNG vehicle ? If yes how many of them are there ?

In [15]:
if 'Fuel_Type' in data.columns:
    print("\nTotal CNG Vehicles:", (data['Fuel_Type'] == 'CNG').sum())

Total CNG Vehicles: 2

How many vehicles here are for sell from Individuals directly ?

In [16]:
if 'Seller_Type' in data.columns:
    print("\nTotal Vehicles Sold by Individuals:", (data['Seller_Type'] == 'Individual').sum())

Total Vehicles Sold by Individuals: 106

Does this database contain auto transmission vehicles ? If yes how many of them are there ?

In [17]:
if 'Transmission' in data.columns:
    print("\nTotal Auto Transmission Vehicles:", (data['Transmission'] == 'Automatic').sum())

Total Auto Transmission Vehicles: 40

How many single person owned vehicles are there in this database ?

In [18]:
if 'Owner' in data.columns:
    print("\nSingle Owner Vehicles Count:", (data['Owner'] == 'First Owner').sum())

Single Owner Vehicles Count: 0

Which is the most and least cost depreciated vehicle in data ?

In [26]:
data["Depreciation"] = data["Present_Price"] - data["Selling_Price"]

# Extract brand from Car_Name
data["Brand"] = data["Car_Name"].apply(lambda x: x.split()[0])

# 1. Count of single-owner vehicles
data[data["Owner"] == 0].shape[0]

# 2. Most and least cost depreciated vehicle
data.loc[data["Depreciation"].idxmax(), ["Car_Name", "Depreciation"]]
data.loc[data["Depreciation"].idxmin(), ["Car_Name", "Depreciation"]]

Car_Name        Honda Activa 4G
Depreciation               0.03
Name: 155, dtype: object

Which brands of vehicles are less affected by cost depreciation ?

In [27]:
data.groupby("Brand")["Depreciation"].mean().sort_values().head(5)

Brand
UM          0.120000
Activa      0.183333
TVS         0.242750
Mahindra    0.250000
Yamaha      0.258750
Name: Depreciation, dtype: float64

Are there any factors which you feel affect the cost depreciation ?

In [28]:
data[["Depreciation", "Year", "Kms_Driven", "Owner"]].corr()

              Depreciation      Year  Kms_Driven     Owner
Depreciation      1.000000 -0.333746    0.333832  0.107415
Year             -0.333746  1.000000   -0.524342 -0.182104
Kms_Driven        0.333832 -0.524342    1.000000  0.089216
Owner             0.107415 -0.182104    0.089216  1.000000

In general selling price is affected by age of vehicle and distance driven by vehicle , is it observable from data ?

In [29]:
data[["Selling_Price", "Year", "Kms_Driven"]].corr()

               Selling_Price      Year  Kms_Driven
Selling_Price       1.000000  0.236141    0.029187
Year                0.236141  1.000000   -0.524342
Kms_Driven          0.029187 -0.524342    1.000000

Can we get idea about newest vehicles i.e. after 2014 manufactured

In [30]:
data[data["Year"] > 2014].shape[0]

147

Can we find out data of only two wheelers from this data ?

In [31]:
bike_keywords = ["bike", "scooter", "motorcycle", "duke", "bullet"]
two_wheelers = data[data["Car_Name"].str.contains("|".join(bike_keywords), case=False, na=False)]
two_wheelers.shape[0]

2

Which is the oldest bike sold here?
Which is the newest bike sold here?
Which is the most sold bike here?

In [42]:
two_wheelers.nsmallest(1, "Year")[["Car_Name", "Year"]]

          Car_Name  Year
112  KTM 390 Duke   2014

In [43]:
two_wheelers.nlargest(1, "Year")[["Car_Name", "Year"]]

                     Car_Name  Year
122  Royal Enfield Bullet 350  2016

In [34]:
data["Year"].min(), data["Year"].max()

(np.int64(2003), np.int64(2018))

Do you find any deal in two wheelers which exceeded the general expectation ? Can you find reason for it ?

In [35]:

bike_keywords = ["bike", "scooter", "motorcycle", "duke", "bullet"]
two_wheelers = data[data["Car_Name"].str.contains("|".join(bike_keywords), case=False, na=False)]
high_selling_bikes = two_wheelers[two_wheelers["Selling_Price"] > two_wheelers["Present_Price"] * 0.8] 
high_selling_bikes

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Unnamed: 9,Unnamed: 10,Unnamed: 11,Depreciation,Brand
122,Royal Enfield Bullet 350,2016,1.05,1.17,6000,Petrol,Individual,Manual,0,NaN,NaN,NaN,0.12,Royal

In [36]:

high_selling_bikes.describe()

,Year,Selling_Price,Present_Price,Kms_Driven,Owner,Unnamed: 9,Unnamed: 10,Depreciation
count,1.0,1.00,1.00,1.0,1.0,0.0,0.0,1.00
mean,2016.0,1.05,1.17,6000.0,0.0,NaN,NaN,0.12
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,2016.0,1.05,1.17,6000.0,0.0,NaN,NaN,0.12
25%,2016.0,1.05,1.17,6000.0,0.0,NaN,NaN,0.12
50%,2016.0,1.05,1.17,6000.0,0.0,NaN,NaN,0.12
75%,2016.0,1.05,1.17,6000.0,0.0,NaN,NaN,0.12
max,2016.0,1.05,1.17,6000.0,0.0,NaN,NaN,0.12

Can we find out data of only cars from this data ?

In [37]:
cars = data[~data["Car_Name"].str.contains("|".join(bike_keywords), case=False, na=False)]
cars.shape[0]

299

Which is the oldest car sold here?

In [38]:
cars.nsmallest(1, "Year")[["Car_Name", "Year"]]

   Car_Name  Year
37      800  2003

Which is the newest car sold here?

In [39]:
cars.nlargest(1, "Year")[["Car_Name", "Year"]]

        Car_Name  Year
5  vitara brezza  2018

Do you find any deal in cars which exceeded the general expectation ? Can you find reason for it ?

In [40]:
high_selling_cars = cars[cars["Selling_Price"] > cars["Present_Price"] * 0.8]
high_selling_cars

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Unnamed: 9,Unnamed: 10,Unnamed: 11,Depreciation,Brand
5,vitara brezza,2018,9.25,9.83,2071,Diesel,Dealer,Manual,0,NaN,NaN,NaN,0.58,vitara
6,ciaz,2015,6.75,8.12,18796,Petrol,Dealer,Manual,0,NaN,NaN,NaN,1.37,ciaz
8,ciaz,2016,8.75,8.89,20273,Diesel,Dealer,Manual,0,NaN,NaN,NaN,0.14,ciaz
9,ciaz,2015,7.45,8.92,42367,Diesel,Dealer,Manual,0,NaN,NaN,NaN,1.47,ciaz
21,ignis,2017,4.90,5.71,2400,Petrol,Dealer,Manual,0,NaN,NaN,NaN,0.81,ignis
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
285,jazz,2016,7.40,8.50,15059,Petrol,Dealer,Automatic,0,NaN,NaN,NaN,1.10,jazz
291,brio,2015,5.40,6.10,31427,Petrol,Dealer,Manual,0,NaN,NaN,NaN,0.70,brio
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,NaN,NaN,NaN,2.10,city
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0,NaN,NaN,NaN,1.00,city
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,NaN,NaN,NaN,0.60,brio

In [41]:
high_selling_cars.describe()

,Year,Selling_Price,Present_Price,Kms_Driven,Owner,Unnamed: 9,Unnamed: 10,Depreciation
count,68.000000,68.000000,68.000000,68.000000,68.000000,0.0,0.0,68.000000
mean,2016.132353,6.326471,7.113485,16200.588235,0.014706,NaN,NaN,0.787015
std,1.035265,6.381173,7.158804,13968.411927,0.121268,NaN,NaN,0.942281
min,2013.000000,0.450000,0.510000,500.000000,0.000000,NaN,NaN,0.030000
25%,2016.000000,1.012500,1.182500,5000.000000,0.000000,NaN,NaN,0.127500
50%,2016.000000,5.250000,5.755000,14732.500000,0.000000,NaN,NaN,0.450000
75%,2017.000000,8.837500,9.400000,21511.500000,0.000000,NaN,NaN,1.100000
max,2018.000000,33.000000,36.230000,68000.000000,1.000000,NaN,NaN,4.640000